# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [94]:
import pandas as pd 
df_data=pd.read_csv(r"C:\Users\LAP TOP\OneDrive\Desktop\my python projects\python\anaconda\Pandas Practice assignment\Data\Purchase_Data.csv")
print (df_data)

      invoice_number   invoice_time store_id  product_id  category_id  \
0       2.020000e+11  7/15/15 10:45     G816     7000300       210101
1       2.020000e+11  7/15/15 12:16     G816     7070884        70203
2       2.020000e+11  7/15/15 12:16     G816     7070884        70203
3       2.020000e+11  7/15/15 12:16     G816     7070891        70401
4       2.020000e+11  7/15/15 12:16     G816     7090363        70401
...              ...            ...      ...         ...          ...
5377    2.020000e+11   9/5/15 23:07      300     7308017       210101
5378    2.020000e+11   9/5/15 23:23     G619     7070891        70401
5379    2.020000e+11   9/5/15 23:24     G619     7071096        70201
5380    2.020000e+11   9/5/15 23:32     G619    15000231        70301
5381    2.020000e+11   9/5/15 23:38     G619    23030206       210101

      num_item  price
0          1.0    2.0
1          1.0    2.0
2          1.0    2.0
3          1.0    6.0
4          1.0    6.0
...        ...    ...
5377       1.0    3.0
5378       1.0    6.0
5379       1.0    5.0
5380       2.0    2.0
5381       1.0    2.0

[5382 rows x 7 columns]

Use the dtypes attribute to view how each column is stored

In [95]:
print(df_data.dtypes)

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [96]:
result_1 = df_data.loc[:, ["invoice_number", "invoice_time"]]
print(result_1)

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [97]:
result_2= df_data.loc[0:1]
print(result_2)

   invoice_number   invoice_time store_id  product_id  category_id  num_item  \
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101       1.0
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0

   price
0    2.0
1    2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [98]:
result_3 = df_data.loc[0:3, ["invoice_number", "invoice_time","store_id", "product_id", "category_id"]]
print(result_3)
print("__"*20)
# anthor way 
result_0 = df_data.iloc[0:4, 0:5]  
print(result_0)

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401
________________________________________
   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [99]:
 result_4=df_data.loc[0:3,["invoice_time","price"]]
 print( result_4)

    invoice_time  price
0  7/15/15 10:45    2.0
1  7/15/15 12:16    2.0
2  7/15/15 12:16    2.0
3  7/15/15 12:16    6.0

Store the number rows in a variable called num_rows.

In [100]:
num_rows=df_data.shape[0]
print(num_rows)

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [101]:
 last_row = df_data.iloc[num_rows - 1]  
print(last_row)

invoice_number    202000000000.0
invoice_time        9/5/15 23:38
store_id                    G619
product_id              23030206
category_id               210101
num_item                     1.0
price                        2.0
Name: 5381, dtype: object

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [102]:
#Write your code here
avg_price = df_data['price'].mean() 
max_price = df_data['price'].max()  
print(f"Average Price: {avg_price}")
print(f"Max Price: {max_price}")

Average Price: 3.1920522110741363
Max Price: 6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [103]:
avg_price, avg_num_item = df_data[['price', 'num_item']].mean()
print(f"Average Price: {avg_price}")
print(f"Average Number of Items: {avg_num_item}")

Average Price: 3.1920522110741363
Average Number of Items: 1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [104]:
df_data['total'] = df_data['price'] * df_data['num_item']
print(df_data)
print("__"*20)
print(df_data['total'])

      invoice_number   invoice_time store_id  product_id  category_id  \
0       2.020000e+11  7/15/15 10:45     G816     7000300       210101
1       2.020000e+11  7/15/15 12:16     G816     7070884        70203
2       2.020000e+11  7/15/15 12:16     G816     7070884        70203
3       2.020000e+11  7/15/15 12:16     G816     7070891        70401
4       2.020000e+11  7/15/15 12:16     G816     7090363        70401
...              ...            ...      ...         ...          ...
5377    2.020000e+11   9/5/15 23:07      300     7308017       210101
5378    2.020000e+11   9/5/15 23:23     G619     7070891        70401
5379    2.020000e+11   9/5/15 23:24     G619     7071096        70201
5380    2.020000e+11   9/5/15 23:32     G619    15000231        70301
5381    2.020000e+11   9/5/15 23:38     G619    23030206       210101

      num_item  price  total
0          1.0    2.0    2.0
1          1.0    2.0    2.0
2          1.0    2.0    2.0
3          1.0    6.0    6.0
4          1.0    6.0    6.0
...        ...    ...    ...
5377       1.0    3.0    3.0
5378       1.0    6.0    6.0
5379       1.0    5.0    5.0
5380       2.0    2.0    4.0
5381       1.0    2.0    2.0

[5382 rows x 8 columns]
________________________________________
0       2.0
1       2.0
2       2.0
3       6.0
4       6.0
       ...
5377    3.0
5378    6.0
5379    5.0
5380    4.0
5381    2.0
Name: total, Length: 5382, dtype: float64

What is the avgerage price of the three most expensive purchases?

In [105]:
#Write your code here
top_3_expensive = df_data.sort_values(by='price', ascending=False).head(3) 
print(top_3_expensive)

      invoice_number   invoice_time store_id  product_id  category_id  \
2979    2.020000e+11  8/21/15 12:14     6666     7070969        70401
761     2.020000e+11  7/24/15 16:47     G816     7090363        70401
4258    2.020000e+11  8/28/15 22:46     6666     7090363        70401

      num_item  price  total
2979       3.0   6.01  18.03
761        2.0   6.00  12.00
4258       1.0   6.00   6.00

How many different products are there?

In [106]:
#Write your code here
unique_products = df_data['product_id'].unique()
print(unique_products)
print("__"*20)
#another way 
unique_products = df_data['product_id'].drop_duplicates()
print(unique_products)

[ 7000300  7070884  7070891  7090363  7000126  7308017 15000231  7071096
  7000133  7071133  7314599  7000294  7313684  7071218  7314612  7090370
 21000782 30000742  7308765  7000140  7070969 21000430  7000034  7000423
 21050107 20098391 30000759 30000766  7000409  7090097  7071102  7071140
  7071164  7000416 21000447 21000379 21000362 30000711  7090462  7090509
  7071331 21050060 21050022  7090455  7090592 23030206  7090493  7071256
  7071249  7090486  7090479  7071232  7090615]
________________________________________
0        7000300
1        7070884
3        7070891
4        7090363
6        7000126
7        7308017
8       15000231
13       7071096
16       7000133
19       7071133
23       7314599
25       7000294
34       7313684
36       7071218
39       7314612
46       7090370
49      21000782
51      30000742
59       7308765
62       7000140
73       7070969
85      21000430
135      7000034
137      7000423
175     21050107
189     20098391
210     30000759
212     30000766
213      7000409
250      7090097
270      7071102
280      7071140
296      7071164
366      7000416
409     21000447
422     21000379
432     21000362
459     30000711
475      7090462
513      7090509
548      7071331
879     21050060
1087    21050022
1319     7090455
2030     7090592
2032    23030206
2849     7090493
3072     7071256
3237     7071249
3444     7090486
3475     7090479
3502     7071232
4683     7090615
Name: product_id, dtype: int64

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [107]:
described_total=df_data["total"].describe()
mean_value = described_total['mean']
median_value = described_total['50%']
difference = mean_value - median_value
print(f"Difference between mean and median: {difference}")

Difference between mean and median: 0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [108]:
#Write your code here
drop_total=df_data.drop('total',axis=1)
print(drop_total)

      invoice_number   invoice_time store_id  product_id  category_id  \
0       2.020000e+11  7/15/15 10:45     G816     7000300       210101
1       2.020000e+11  7/15/15 12:16     G816     7070884        70203
2       2.020000e+11  7/15/15 12:16     G816     7070884        70203
3       2.020000e+11  7/15/15 12:16     G816     7070891        70401
4       2.020000e+11  7/15/15 12:16     G816     7090363        70401
...              ...            ...      ...         ...          ...
5377    2.020000e+11   9/5/15 23:07      300     7308017       210101
5378    2.020000e+11   9/5/15 23:23     G619     7070891        70401
5379    2.020000e+11   9/5/15 23:24     G619     7071096        70201
5380    2.020000e+11   9/5/15 23:32     G619    15000231        70301
5381    2.020000e+11   9/5/15 23:38     G619    23030206       210101

      num_item  price
0          1.0    2.0
1          1.0    2.0
2          1.0    2.0
3          1.0    6.0
4          1.0    6.0
...        ...    ...
5377       1.0    3.0
5378       1.0    6.0
5379       1.0    5.0
5380       2.0    2.0
5381       1.0    2.0

[5382 rows x 7 columns]

Let's dig a little deeper into the data set and answer some basic question.

In [ ]:
#Write your code here

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [122]:
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time']) 

# Print the data types of all columns
print(df_data.dtypes)

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
total                    float64
DOW                        int32
Month                      int32
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [110]:
#Write your code  
df_data['DOW'] = df_data['invoice_time'].dt.weekday
df_data['Month'] = df_data['invoice_time'].dt.month
print(df_data.head())

   invoice_number        invoice_time store_id  product_id  category_id  \
0    2.020000e+11 2015-07-15 10:45:00     G816     7000300       210101
1    2.020000e+11 2015-07-15 12:16:00     G816     7070884        70203
2    2.020000e+11 2015-07-15 12:16:00     G816     7070884        70203
3    2.020000e+11 2015-07-15 12:16:00     G816     7070891        70401
4    2.020000e+11 2015-07-15 12:16:00     G816     7090363        70401

   num_item  price  total  DOW  Month
0       1.0    2.0    2.0    2      7
1       1.0    2.0    2.0    2      7
2       1.0    2.0    2.0    2      7
3       1.0    6.0    6.0    2      7
4       1.0    6.0    6.0    2      7

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [111]:
#Write your code here
num_purchases_wed= df_data['DOW'].value_counts()[2]
print(f"Number of purchases made on Wednesday: {num_purchases_wed}")

Number of purchases made on Wednesday: 959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [112]:
#Write your code here
import pandas as pd 
df_titanic=pd.read_csv(r"C:\Users\LAP TOP\OneDrive\Desktop\my python projects\python\anaconda\Pandas Practice assignment\Data\Titanic.csv").head()
print (df_titanic)

   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0  34.5      0      0   330911   7.8292   NaN        Q
1  47.0      1      0   363272   7.0000   NaN        S
2  62.0      0      0   240276   9.6875   NaN        Q
3  27.0      0      0   315154   8.6625   NaN        S
4  22.0      1      1  3101298  12.2875   NaN        S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [113]:
df_titanic.rename(columns={"Name": "Passenger_Name", "Ticket": "Ticket_Num"}, inplace=True)
print(df_titanic.head())

   PassengerId  Pclass                                Passenger_Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
0  34.5      0      0     330911   7.8292   NaN        Q
1  47.0      1      0     363272   7.0000   NaN        S
2  62.0      0      0     240276   9.6875   NaN        Q
3  27.0      0      0     315154   8.6625   NaN        S
4  22.0      1      1    3101298  12.2875   NaN        S

Change the index of the df_titanic to the column PasengerID.

In [114]:
df_titanic.set_index('PassengerId', inplace=True)
print(df_titanic.head())

             Pclass                                Passenger_Name     Sex  \
PassengerId
892               3                              Kelly, Mr. James    male
893               3              Wilkes, Mrs. James (Ellen Needs)  female
894               2                     Myles, Mr. Thomas Francis    male
895               3                              Wirz, Mr. Albert    male
896               3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

              Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
PassengerId
892          34.5      0      0     330911   7.8292   NaN        Q
893          47.0      1      0     363272   7.0000   NaN        S
894          62.0      0      0     240276   9.6875   NaN        Q
895          27.0      0      0     315154   8.6625   NaN        S
896          22.0      1      1    3101298  12.2875   NaN        S

Select the name of passenger 896

In [115]:
#Write your code 
passenger_name = df_titanic.loc[896, 'Passenger_Name']
print(passenger_name)

Hirvonen, Mrs. Alexander (Helga E Lindqvist)

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [116]:
#Write your code here 
df_titanic.reset_index(drop=False, inplace=True)
print(df_titanic.head())

   PassengerId  Pclass                                Passenger_Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
0  34.5      0      0     330911   7.8292   NaN        Q
1  47.0      1      0     363272   7.0000   NaN        S
2  62.0      0      0     240276   9.6875   NaN        Q
3  27.0      0      0     315154   8.6625   NaN        S
4  22.0      1      1    3101298  12.2875   NaN        S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [117]:
#Write you code here
missing=df_titanic['Age'].isnull().sum()
print(missing)

0

Compute the avg age of passengers ignoring the missing data.

In [118]:
#Write your code here
avg_age = df_titanic['Age'].mean()
print(avg_age)

38.5

Using the fillna() method replace the missing values in the Age column with the mean.

In [119]:
#Write your code here
df_titanic['Age'] = df_titanic['Age'].fillna(avg_age)
print(df_titanic['Age'])

0    34.5
1    47.0
2    62.0
3    27.0
4    22.0
Name: Age, dtype: float64

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [121]:
#Write your code here
top_5_olders = df_titanic.sort_values(by='Age', ascending=False).head(5) 
print(top_5_olders )
top_5_oldest_reset = top_5_olders.reset_index(drop=True)
print(top_5_oldest_reset)
top_5_oldest_reset['Age'].mean()

   PassengerId  Pclass                                Passenger_Name     Sex  \
2          894       2                     Myles, Mr. Thomas Francis    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
0          892       3                              Kelly, Mr. James    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
2  62.0      0      0     240276   9.6875   NaN        Q
1  47.0      1      0     363272   7.0000   NaN        S
0  34.5      0      0     330911   7.8292   NaN        Q
3  27.0      0      0     315154   8.6625   NaN        S
4  22.0      1      1    3101298  12.2875   NaN        S
   PassengerId  Pclass                                Passenger_Name     Sex  \
0          894       2                     Myles, Mr. Thomas Francis    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          892       3                              Kelly, Mr. James    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
0  62.0      0      0     240276   9.6875   NaN        Q
1  47.0      1      0     363272   7.0000   NaN        S
2  34.5      0      0     330911   7.8292   NaN        Q
3  27.0      0      0     315154   8.6625   NaN        S
4  22.0      1      1    3101298  12.2875   NaN        S

38.5